[{"id":"4n6ooc7kc5jx9mm","title":"Pagina para aprender codigo","site":"https://www.freecodecamp.org/learn/","description":"Sitio donde se puede aprender diferentes temas de programación (dan certificado gratuito)"},{"id":"4n6oow6kc5k1fkv","title":"Webpack 4","site":"https://www.youtube.com/watch?v=vF2emKbaP4M","description":"Webpack 4 es un empaquetador de módulos, muy utilizado en archivos del Frontend y necesario en todos los frameworks de Javascript como React, Angular, y Vue.js y otros desarrollos de Javascript en el Frontend."},{"id":"4n6oozzkc5k5e60","title":"Nodejs Curso Desde Cero","site":"https://www.youtube.com/watch?v=BhvLIzVL8_o&t=42s","description":"Este curso de Nodejs, es una introducción practica para Desarrolladores Web, que tienen como objetivo crear aplicaciones Backend, utilizando el lenguaje que ya conocen: Javascript."},{"id":"4n6objkc5k8h7x","title":"Stripe & Node.js, Pagos Online","site":"https://www.youtube.com/watch?v=o9eij8FEvuA&t=101s","description":"Aprende a aceptar pagos en linea en tu sitio web o aplicación web, a través de Stripe. Stripe es un servicio web que te ayuda a aceptar tarjetas de créditos de tus usuarios y provee una API fácil de integrar."},{"id":"4n6ofgkc5k9tor","title":"Nodejs y Mongodb, Aplicación de Imagenes estilo Pinterest","site":"https://www.youtube.com/watch?v=aNYX2F1RX-s","description":"Aprende a crear una aplicación que te permite subir imagenes, eliminarlas y listarlas usando Nodejs, Mongodb y multer. En este ejemplo aprenderemos como crear una aplicación web al estilo pinterest usando Javascript y Bootstrap4."},{"id":"4n6oiikc5kcq4b","title":"Nodejs, Typescript y Mongodb Aplicación de Servidor","site":"https://www.youtube.com/watch?v=UipIQ81kabs","description":"Aprende a utilizar Typescript en tus proximas aplicaciones de Servidor usando Nodejs. En este ejemplo práctico aprenderemos a crear una aplicación desde Cero, configurando typescript, conectandonos a una Base de datos NoSQL como lo es Mongodb, ademas de usar otros codigo de Javascript en el servidor."},{"id":"4n6op8kc5kfub7","title":"Nodejs y Ajax | Simple REST API CRUD","site":"https://www.youtube.com/watch?v=sqt4wK4yU1w&t=1867s","description":"Aprende a crear una aplicación web de una sola página simple utilizando Nodejs y AJAX (REST API). Crearemos, Editaremos, Listaremos y Eliminaremos datos sin que un página se refresque."},{"id":"4foin9xakc68orux","title":"Sitio Web con HTML, CSS y Javascript","site":"https://www.youtube.com/watch?v=Q2imkhmhOFo","description":"TERMIANDO - Este es un ejemplo práctico de HTML, CSS y Javascript en el que crearemos el diseño de un sitio web de noticias llamado Technews. Para esto usaremos conceptos como CSS GRID, Flexbox y una biblioteca llamada ScrollReveal. Y finalmente terminaremos subiendo nuestro sitio web a un Hosting Compartido usando un Servicio llamado SiteGround."},{"id":"4foinavfkc68s8p2","title":"Tu primer Página Web en Nodejs","site":"https://www.youtube.com/watch?v=sh-NanMOh1Q&t=3161s","description":"TERMINADO -  Aprende a crear un sitio web completamente desde cero utilizando Nodejs, y Express. este ejemplo plantea la creación de un sitio con una navegación dinamica de manera similar como se haría con PHP."},{"id":"4foinazdkc68ucfh","title":"Nodejs, Express & JSON | Guardando datos en Archivo JSON","site":"https://www.youtube.com/watch?v=YiBDvtEP88M","description":"TERMINADO - Este video es un ejemplo practico de Nodejs y Express en el que aprenderemos a guardar los datos de nuestra aplicación en un archivo JSON."},{"id":"4foinb2ikc68wvjd","title":"Nodejs y MongoDB Red Social","site":"https://www.youtube.com/watch?v=TqC3e8nBycg","description":"Aprende a crear una aplicación web de subida de imagenes, similar a la red social imgur.com. En este vídeo utilizaremos Nodejs, Express y Mongodb para crear la logica de nuestra aplicación ademas de una enorme cantidad de conceptos de frontend como Bootstrap4, Handlebars, jquery, ajax, y mucho más."}]